** Test file:./temp.pl
   #+BEGIN_SRC perl :tangle ./temp.pl :shebang #!/usr/bin/env perl
     use warnings;
     use strict;

     # my $file = $ARGV[0] or die "Please supply a filename";
     my @images = <*.png>;

     use Image::Magick;
     my ($image, $screenshot);
     my ($red, $green, $blue, $opacity) = (0,0,0,0);

     foreach my $image (@images) {

         $image = Image::Magick->new;
         $screenshot = $image->Read($file);
         my $height = $image->Get('height');
         my $width = $image->Get('width');

     # print "h:$height, w:$width\n";

         ($red, $green, $blue) = get_point(592,1188);
         if ( $red == 59881 ) {
             # print "0 at ", " ($red, $green, $blue) ", `date`;
             print ".";
         } elsif ( $red == 61166 ) {
             print "\n1.2X at ", " ($red, $green, $blue) ", `date`;
         } elsif ( $red == 60909 ) {
             print "\n1.5X at ", " ($red, $green, $blue) ", `date`;
         } else {
             system("gwenview $file 2>/dev/null &");
             print "\nUnknown: $red, $green, $blue\n";
             print `cal`;
         }
         $image->DESTROY();
     }
     sub get_point {
       my ($x,$y) = @_;
       my ($red, $green, $blue, $opacity) = (0,0,0,0);
       ($red, $green, $blue, $opacity) = split /,/, $image->Get("pixel[$x,$y]");
       return ($red, $green, $blue);
     }

     sub find_location {

         my $x = 0;
         my $y = 0;
         my $match = 0;
         my $line_sum = 0;
         for ( 0..$height-1 )  {
             $match = 0;
             $line_sum = 0;
             $y = $_;
             for ( 0..$width-1 )  {
                 $x = $_;
                 ($red, $green, $blue, $opacity) = (0,0,0,0);
                 ($red, $green, $blue, $opacity) = split /,/, $image->Get("pixel[$x,$y]");
                 if ($red==16962 && $green==34181 && $blue==62708) {
                     $line_sum+=1;
                     if ( $match == 0 ) {
                         $match = 1;
                         print "$y:";
                     }
                 }
             }
             if ( $match == 1 ) {
                 print "$line_sum\n";
             }
         }
     }
   #+END_SRC

   #+RESULTS:
   : Exception 435: unable to open image `uber.png': No such file or directory @ error/blob.c/OpenBlob/2702
